Revit 2027 API
Frame.IsOrthogonal Method
 Determines if this frame's basis vectors are orthogonal.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsOrthogonal()
Public Function IsOrthogonal As Boolean
public:
bool IsOrthogonal()
member IsOrthogonal : unit -> bool
Return Value
Boolean
 True if this frame's basis vectors are orthogonal, false if not.
See Also
Reference
Frame Class
Autodesk.Revit.DB Namespace